; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	spectrograph1 - mode
	infrared0 - mode
	GroundStation1 - direction
	Star4 - direction
	Star5 - direction
	Star6 - direction
	Star7 - direction
	Star8 - direction
	GroundStation10 - direction
	Star12 - direction
	GroundStation0 - direction
	Star9 - direction
	GroundStation11 - direction
	Star3 - direction
	Star2 - direction
	Phenomenon13 - direction
	Phenomenon14 - direction
	Star15 - direction
	Star16 - direction
	Star17 - direction
	Phenomenon18 - direction
	Star19 - direction
	Star20 - direction
)
(:init
	(supports instrument0 infrared0)
	(calibration_target instrument0 GroundStation0)
	(supports instrument1 spectrograph1)
	(calibration_target instrument1 Star9)
	(supports instrument2 infrared0)
	(supports instrument2 spectrograph1)
	(calibration_target instrument2 Star2)
	(calibration_target instrument2 Star3)
	(calibration_target instrument2 GroundStation11)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star19)
)
(:goal (and
	(pointing satellite0 Star2)
	(have_image Phenomenon13 spectrograph1)
	(have_image Phenomenon14 infrared0)
	(have_image Star15 spectrograph1)
	(have_image Star16 infrared0)
	(have_image Star17 infrared0)
	(have_image Phenomenon18 infrared0)
	(have_image Star19 spectrograph1)
	(have_image Star20 spectrograph1)
))

)

; plan
1. (turn_to satellite0 groundstation11 star19)
   deleted: (pointing satellite0 star19)
   added: (pointing satellite0 groundstation11)
   goals met: 0 of 9
2. (switch_on instrument2 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument2)
   goals met: 0 of 9
3. (calibrate satellite0 instrument2 groundstation11)
   added: (calibrated instrument2)
   goals met: 0 of 9
4. (turn_to satellite0 phenomenon18 groundstation11)
   deleted: (pointing satellite0 groundstation11)
   added: (pointing satellite0 phenomenon18)
   goals met: 0 of 9
5. (take_image satellite0 phenomenon18 instrument2 infrared0)
   added: (have_image phenomenon18 infrared0)
   goals met: 1 of 9
6. (turn_to satellite0 phenomenon14 phenomenon18)
   deleted: (pointing satellite0 phenomenon18)
   added: (pointing satellite0 phenomenon14)
   goals met: 1 of 9
7. (take_image satellite0 phenomenon14 instrument2 infrared0)
   added: (have_image phenomenon14 infrared0)
   goals met: 2 of 9
8. (turn_to satellite0 phenomenon13 phenomenon14)
   deleted: (pointing satellite0 phenomenon14)
   added: (pointing satellite0 phenomenon13)
   goals met: 2 of 9
9. (take_image satellite0 phenomenon13 instrument2 spectrograph1)
   added: (have_image phenomenon13 spectrograph1)
   goals met: 3 of 9
10. (turn_to satellite0 star15 phenomenon13)
   deleted: (pointing satellite0 phenomenon13)
   added: (pointing satellite0 star15)
   goals met: 3 of 9
11. (take_image satellite0 star15 instrument2 spectrograph1)
   added: (have_image star15 spectrograph1)
   goals met: 4 of 9
12. (turn_to satellite0 star16 star15)
   deleted: (pointing satellite0 star15)
   added: (pointing satellite0 star16)
   goals met: 4 of 9
13. (take_image satellite0 star16 instrument2 infrared0)
   added: (have_image star16 infrared0)
   goals met: 5 of 9
14. (turn_to satellite0 star17 star16)
   deleted: (pointing satellite0 star16)
   added: (pointing satellite0 star17)
   goals met: 5 of 9
15. (take_image satellite0 star17 instrument2 infrared0)
   added: (have_image star17 infrared0)
   goals met: 6 of 9
16. (turn_to satellite0 star19 star17)
   deleted: (pointing satellite0 star17)
   added: (pointing satellite0 star19)
   goals met: 6 of 9
17. (take_image satellite0 star19 instrument2 spectrograph1)
   added: (have_image star19 spectrograph1)
   goals met: 7 of 9
18. (turn_to satellite0 star20 star19)
   deleted: (pointing satellite0 star19)
   added: (pointing satellite0 star20)
   goals met: 7 of 9
19. (take_image satellite0 star20 instrument2 spectrograph1)
   added: (have_image star20 spectrograph1)
   goals met: 8 of 9
20. (turn_to satellite0 star2 star20)
   deleted: (pointing satellite0 star20)
   added: (pointing satellite0 star2)
   goals met: 9 of 9
